#!/bin/bash

###########################
##
## Telegram BOT uninstaller
##     2015.12.31 by tescom
##
###########################

echo "----------------------------------"
echo "   설치 디렉토리를 삭제합니다.    "
echo "----------------------------------"
rm -vrf /tmp/tg

# 서버모니터링 실행 스크립트 삭제
echo "----------------------------------"
echo "   실행 스크립트를 삭제합니다.    "
echo "----------------------------------"
sudo rm -vf /etc/init.d/telegramd

echo " "
echo "----------------------------------"
echo "  프로그램 삭제가 완료되었습니다. "
echo "----------------------------------"
